Tester/src/Enums/Access/Access.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Access</name>
  <enumValues>
    <name>Undefined</name>
  </enumValues>
  <enumValues>
    <name>Allow</name>
  </enumValues>
  <enumValues>
    <name>Forbid</name>
  </enumValues>
</mdclass:Enum>

Tester/src/Catalogs/Users/Users.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Users</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>AccessDenied</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Agent</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ApplicationsAccess</name>
    <type>
      <types>EnumRef.Access</types>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FirstName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>75</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FullName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Language</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LastName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>75</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TimeZone</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Applications</name>
    <attributes>
      <name>Application</name>
      <type>
        <types>CatalogRef.Applications</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Managers</name>
    <attributes>
      <name>User</name>
      <type>
        <types>CatalogRef.Users</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Rights</name>
    <attributes>
      <name>RoleName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Tester/src/CommonModules/Logins/Module.bsl
Function AccessDenies () export
	
	SetPrivilegedMode ( true );
	return DF.Pick ( SessionParameters.User, "AccessDenied" );
	
EndFunction 

Procedure Init () export
	
	SetPrivilegedMode ( true );
	user = Catalogs.Users.CreateItem ();
	user.Email = "user@domain.com";
	name = Output.UserAdmin ();
	user.FirstName = name;
	user.Description = name;
	user.Code = "ADM";
	user.Language = CurrentLanguage ().Name;
	user.TimeZone = TimeZone ();
	user.ApplicationsAccess = Enums.Access.Undefined;
	right = user.Rights.Add ();
	right.RoleName = "Administrator";
	user.Write ();
	SetPrivilegedMode ( false );
	
EndProcedure 

Function CanEditScenarios () export
	
	return AccessRight ( "Edit", Metadata.Catalogs.Scenarios );
	
EndFunction
